src/Documents/ЭлектронноеПисьмо/ЭлектронноеПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмо</name>
  <attributes>
    <name>Получатели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тело</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вложения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЭлектронноеПисьмо/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ОтправитьПисьмоНаСервере()
	ОбъектДокумент = РеквизитФормыВЗначение("Объект");
	ОбъектДокумент.ОтправитьПисьмо();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	ОтправитьПисьмоНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьВложениеНаСервере(Ключ)
	Об = РеквизитФормыВЗначение("Объект");
	ТекущиеДанные = Об.Вложения.НайтиСтроки(Новый Структура("Ключ", Ключ))[0];
	Возврат ПоместитьВоВременноеХранилище(ТекущиеДанные.Значение.Получить());
КонецФункции

&НаКлиенте
Процедура ОткрытьВложение(Команда)
	ТекущиеДанные = Элементы.Вложения1.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Адрес = ПолучитьВложениеНаСервере(ТекущиеДанные.Ключ);
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	#Если ВебКлиент Тогда
		ВременныйФайл = СтрШаблон("%1%2.%3", КаталогВременныхФайлов(), ТекущиеДанные.Ключ, ТекущиеДанные.Расширение);
	#Иначе
		ВременныйФайл = ПолучитьИмяВременногоФайла(ТекущиеДанные.Расширение);
	#КонецЕсли
	Данные.Записать(ВременныйФайл);
	НачатьЗапускПриложения(Новый ОписаниеОповещения, ВременныйФайл);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Вложения = Новый Структура;
	Для Каждого Стр Из ТекущийОбъект.Вложения Цикл
		Вложения.Вставить(Стр.Ключ, Стр.Значение.Получить());
	КонецЦикла;
	ФорматированныйДокумент.УстановитьHTML(ТекущийОбъект.Тело, Вложения);
КонецПроцедуры
